Classes | Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::RoutingNode Class Referencefinal
MEP Element Manager
The RoutingNode can contain Elbow and Transition elements. More...
#include <MEPRoutingNode.hpp>
 Inheritance diagram for ACAPI::MEP::RoutingNode:
 Classes
class  | Modifier
Modifier of the RoutingNode. More...
 Public Member Functions
API_Coord3D  | GetPosition () const
std::optional< UniqueID >  | GetIncomingSegmentId () const
std::optional< UniqueID >  | GetOutgoingSegmentId () const
std::vector< UniqueID >  | GetElbowIds () const
std::vector< UniqueID >  | GetTransitionIds () const
PreferredTransitionPlacement  | GetPreferredTransitionPlacement () const
UniqueID  | GetRoutingElementId () const
Domain  | GetDomain () const
RoutingNodeDefault  | PickUpDefault () const
Picks up and returns the Default of the RoutingNode.
TransitionDefault  | GetTransitionDefaultParameters () const
ElbowDefault  | GetElbowDefaultParameters () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the given modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::ElementBase
UniqueID  | GetElemId () const
Get unique identifier of the ElementBase object.
Result< void >  | IsEditable () const
Checks whether the element is editable.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< RoutingNode >  | Get (const UniqueID &uniqueId)
Returns a RoutingNode.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::ElementBase
ElementBase (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new ElementBase.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The RoutingNode can contain Elbow and Transition elements.
This type of element is placed in the corner points of RoutingElement.
Since
Archicad 27
Example code snippet from Test / New MEP
Getters
 ACAPI::Result<RoutingNode> routingNode = RoutingNode::Get (id);
 if (routingNode.IsErr ()) {
 ACAPI_WriteReport (routingNode.UnwrapErr ().text.c_str (), false);
 return;
 }
 Reporter routingNodeReporter (1);
 routingNodeReporter.Add ("Routing Node id", id);
 routingNodeReporter.SetTabCount (2);
 routingNodeReporter.Add ("Position", routingNode->GetPosition ());
 routingNodeReporter.Add ("Preferred Transition Placement", routingNode->GetPreferredTransitionPlacement ());
 std::optional<UniqueID> incomingSegmentId = routingNode->GetIncomingSegmentId ();
 incomingSegmentId.has_value () ? routingNodeReporter.Add ("Id of Incoming Segment", *incomingSegmentId) : routingNodeReporter.Add ("Does not have Incoming Segment.");
 std::optional<UniqueID> outgoingSegmentId = routingNode->GetOutgoingSegmentId ();
 outgoingSegmentId.has_value () ? routingNodeReporter.Add ("Id of Outgoing Segment", *outgoingSegmentId) : routingNodeReporter.Add ("Does not have Outgoing Segment.");
 routingNodeReporter.Write ();
 // Elbows
 std::vector<UniqueID> elbowIds = routingNode->GetElbowIds ();
 if (!elbowIds.empty ()) {
 ACAPI_WriteReport ("\t\tList of Elbows:\n", false);
 for (const UniqueID& id : elbowIds)
 WriteElbowDetails (id);
 }
 // Transitions
 std::vector<UniqueID> transitionIds = routingNode->GetTransitionIds ();
 if (!transitionIds.empty ()) {
 ACAPI_WriteReport ("\t\tList of Transitions:\n", false);
 for (const UniqueID& id : transitionIds)
 WriteTransitionDetails (id);
 }
 Modification
 const API_Coord3D& currentPosition = routingNode.GetPosition ();
 ACAPI::Result<void> modifyResult = routingNode.Modify ([&](RoutingNode::Modifier& modifier) {
 API_Coord3D position (currentPosition);
 position.x -= 5.0;
 modifier.SetPosition (position);
 }, "Elevate a Node of Routing Element.");
 if (modifyResult.IsErr ())
 return modifyResult.UnwrapErr ().kind;
 return NoError;
Member Function Documentation
◆ Get()
 static Result< RoutingNode > ACAPI::MEP::RoutingNode::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns a RoutingNode.
Parameters
uniqueId | The UniqueID of the requested RoutingNode.
Returns
If the uniqueId belongs to a RoutingNode, returns the object associated to it, otherwise Error.
◆ GetDomain()
 Domain ACAPI::MEP::RoutingNode::GetDomain  |  ( |   | ) |   const
Returns
Returns the domain of the RoutingNode.
◆ GetElbowDefaultParameters()
 ElbowDefault ACAPI::MEP::RoutingNode::GetElbowDefaultParameters  |  ( |   | ) |   const
Returns
Returns the default parameters of the uncustomized Elbows.
◆ GetElbowIds()
 std::vector< UniqueID > ACAPI::MEP::RoutingNode::GetElbowIds  |  ( |   | ) |   const
Returns
Returns the UniqueIDs of the contained Elbows.
◆ GetIncomingSegmentId()
 std::optional< UniqueID > ACAPI::MEP::RoutingNode::GetIncomingSegmentId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the incoming segment if it has any.
◆ GetOutgoingSegmentId()
 std::optional< UniqueID > ACAPI::MEP::RoutingNode::GetOutgoingSegmentId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the outgoing segment if it has any.
◆ GetPosition()
 API_Coord3D ACAPI::MEP::RoutingNode::GetPosition  |  ( |   | ) |   const
Returns
Returns the position of the RoutingNode.
◆ GetPreferredTransitionPlacement()
 PreferredTransitionPlacement ACAPI::MEP::RoutingNode::GetPreferredTransitionPlacement  |  ( |   | ) |   const
Returns
Returns the rule of the Elbow-Transition placement order of the RoutingNode.
◆ GetRoutingElementId()
 UniqueID ACAPI::MEP::RoutingNode::GetRoutingElementId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the RoutingElement that it belongs to.
◆ GetTransitionDefaultParameters()
 TransitionDefault ACAPI::MEP::RoutingNode::GetTransitionDefaultParameters  |  ( |   | ) |   const
Returns
Returns the default parameters of the uncustomized Transitions.
◆ GetTransitionIds()
 std::vector< UniqueID > ACAPI::MEP::RoutingNode::GetTransitionIds  |  ( |   | ) |   const
Returns
Returns the UniqueIDs of the contained Transitions.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::RoutingNode::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the given modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ PickUpDefault()
 RoutingNodeDefault ACAPI::MEP::RoutingNode::PickUpDefault  |  ( |   | ) |   const
Picks up and returns the Default of the RoutingNode.
Returns
Returns a RoutingNodeDefault with the parameters of the object it was called for.